package com.example.spongebobgame.quizz_game.data

object QuestionsDataProvider {
    val questions = listOf(
        Question(
            statement = "Как зовут лучшего друга Губки Боба?",
            response = "Патрик Звезда",
            propositions = listOf(
                "Сквидвард Тентаклс",
                "Патрик Звезда",
                "Сэнди Щёки",
                "Гарри Песочник"
            )
        ),
        Question(
            statement = "В каком городе живет Губка Боб?",
            response = "Бикини Боттом",
            propositions = listOf(
                "Бикини Боттом",
                "Нью-Йорк",
                "Москва",
                "Токио"
            )
        ),
        Question(
            statement = "Как зовут босса Губки Боба?",
            response = "Мистер Крабс",
            propositions = listOf(
                "Планктон",
                "Мистер Крабс",
                "Сквидвард Тентаклс",
                "Патрик Звезда"
            )
        ),
        Question(
            statement = "Как называется ресторан, в котором работает Губка Боб?",
            response = "Красти Краб",
            propositions = listOf(
                "Красти Краб",
                "Шейк Шек",
                "Макдоналдс",
                "Бургер Кинг"
            )
        ),
        Question(
            statement = "Как зовут врага Мистера Крабса, который всегда пытается украсть секретный рецепт крабсбургера?",
            response = "Планктон",
            propositions = listOf(
                "Патрик Звезда",
                "Сквидвард Тентаклс",
                "Планктон",
                "Сэнди Щёки"
            )
        ),
        Question(
            statement = "Как зовут улитку, которая принадлежит Губке Бобу?",
            response = "Гарри",
            propositions = listOf(
                "Гарри",
                "Сэм",
                "Боб",
                "Джордж"
            )
        ),
        Question(
            statement = "Как зовут сестру Сквидварда?",
            response = "Скулли",
            propositions = listOf(
                "Скулли",
                "Салли",
                "Сьюзи",
                "Сара"
            )
        ),
        Question(
            statement = "Как зовут родителей Губки Боба?",
            response = "Гарольд и Маргарет",
            propositions = listOf(
                "Гарольд и Маргарет",
                "Генри и Мэри",
                "Гарри и Мелисса",
                "Георг и Марта"
            )
        ),
        Question(
            statement = "Как зовут учителя вождения Губки Боба?",
            response = "Миссис Пафф",
            propositions = listOf(
                "Миссис Пафф",
                "Миссис Смит",
                "Миссис Джонс",
                "Миссис Браун"
            )
        ),
        Question(
            statement = "Как зовут владельца Чумного Краба?",
            response = "Планктон",
            propositions = listOf(
                "Мистер Крабс",
                "Патрик Звезда",
                "Сквидвард Тентаклс",
                "Планктон"
            )
        ),
        Question(
            statement = "Как зовут кузена Губки Боба?",
            response = "Стэнли",
            propositions = listOf(
                "Стэнли",
                "Стив",
                "Сэм",
                "Скотт"
            )
        ),
        Question(
            statement = "Как зовут дядю Губки Боба, который является владельцем ресторана 'Крабс О' Мандей'?",
            response = "Капитан Голубой Крабс",
            propositions = listOf(
                "Капитан Голубой Крабс",
                "Капитан Красный Крабс",
                "Капитан Зеленый Крабс",
                "Капитан Желтый Крабс"
            )
        ),
        Question(
            statement = "Как зовут бабушку Губки Боба?",
            response = "Бабушка Квадратные Штаны",
            propositions = listOf(
                "Бабушка Круглые Штаны",
                "Бабушка Квадратные Штаны",
                "Бабушка Треугольные Штаны",
                "Бабушка Прямоугольные Штаны"
            )
        ),
        Question(
            statement = "Как зовут медузу, которую Губка Боб держит как домашнее животное?",
            response = "Медуза",
            propositions = listOf(
                "Медуза",
                "Кальмар",
                "Улитка",
                "Рыба"
            )
        ),
        Question(
            statement = "Как зовут супергероя, которого обожает Губка Боб?",
            response = "Человек-Скат",
            propositions = listOf(
                "Человек-Скат",
                "Человек-Крабс",
                "Человек-Патрик",
                "Человек-Сквидвард"
            )
        ),
        Question(
            statement = "Как зовут супергероя, которого обожает Патрик Звезда?",
            response = "Человек-Морковка",
            propositions = listOf(
                "Человек-Морковка",
                "Человек-Брокколи",
                "Человек-Яблоко",
                "Человек-Банан"
            )
        ),
        Question(
            statement = "Как зовут доктора, который лечит Губку Боба?",
            response = "Доктор Гилл Гиллам",
            propositions = listOf(
                "Доктор Гилл Гиллам",
                "Доктор Фиш",
                "Доктор Крабс",
                "Доктор Сквидвард"
            )
        ),
        Question(
            statement = "Как зовут полицейского, который часто арестовывает Планктона?",
            response = "Офицер Нэнси",
            propositions = listOf(
                "Офицер Нэнси",
                "Офицер Патрик",
                "Офицер Губка Боб",
                "Офицер Сквидвард"
            )
        ),
        Question(
            statement = "Как зовут морскую звезду, которая живет рядом с Губкой Бобом?",
            response = "Патрик Звезда",
            propositions = listOf(
                "Патрик Звезда",
                "Сквидвард Тентаклс",
                "Сэнди Щёки",
                "Гарри Песочник"
            )
        ),
        Question(
            statement = "Как зовут водоросль, которую Губка Боб любит есть?",
            response = "Кельпо",
            propositions = listOf(
                "Кельпо",
                "Салат",
                "Морская капуста",
                "Морской горошек"
            )
        ),
    )
}